#+TITLE: Currency conversion using Spark

** Loading exchange rates

Exchange rates are loaded from an external provider at some infrequent
schedule (say every month), reshaped to our model and stored somewhere
durably. The easiest way is to use cloud object storage service like
Amazon S3, which gives durability, versioning and notifications about
changes.

The file would contain exchange rates from a currency to some base
currency like USD or EUR for a few hundreds of currencies.

Exchange rates should be updated at some interval, in the requirements
it's said to use monthly updating rate, but months are somewhat tricky
to use since they contain different number of days and February has
variadic length, and also the requirements might change to update
rates more often, so assume that rates would be updated at some fixed
interval in seconds like 4 weeks:

#+begin_src calc :exports both
interval_length = 4 * 7 * 24 * 60 * 60
#+end_src

#+RESULTS:
: interval_length = 2419200

When loading FX rates at moment T we set rates to be valid for the
next interval, thus ensuring that for a given transaction exchange
rate is always available. The following formula is used to get the
period of validity:

#+begin_src python :results verbatim :exports both
interval_length = 4 * 7 * 24 * 60 * 60
t = 1626436324
div, _ = divmod(t, interval_length)
return {
 'effective_from': (div+1)*interval_length,
 'effective_to': (div+2)*interval_length
}
#+end_src

#+RESULTS:
: {'effective_from': 1628121600, 'effective_to': 1630540800}

Let's use CSV format with the following schema:

| column         | datatype |            example | description                                    |
|----------------+----------+--------------------+------------------------------------------------|
| currency       | string   |                EUR | target currency                                |
| rate           | double   | 1.1797252419911401 | FX rate from currency to USD                   |
| created_at     | int      |         1626436324 | Unix timestamp when the record was inserted    |
| effective_from | int      |         1628121600 | Unix timestamp of the start period of validity |
| effective_to   | int      |         1630540800 | Unix timestamp of the end period of validity   |


We can estimate the number of records in the rates file:

#+begin_src python :results verbatim :exports both
currencies = 180
years_of_operation = 50
interval_length_days = 1/28.0
records = round(currencies * years_of_operation * 365 * interval_length_days)
bytes_per_record = 3 + 8*4 # one 3-char string and 4 numbers 8 bytes each

return {"records": records, "bytes": bytes_per_record*records}
#+end_src

#+RESULTS:
: {'records': 117321, 'bytes': 4106235}

So, the file with exchange rates would be tiny in comparison to
transactions, so we can load the whole file in memory (hash-map) and
experience O(1) access time.

For bulk processing, we'd load the file at startup time of the job,
for streaming processing we load the file at startup and also
subscribe to the topic with notifications that rates file is updated.
Upon receiving a notification, we load a new file into a temporary
buffer, then pause execution and atomically switch old hash-map to a
new buffer. I'm not sure how to do that in Spark Structured Streaming,
but in Go I'd use =map= with =sync.RWMutex{}= and lock the mutex for
writing when switching.


